import pandas as pd
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
from setup import setup_environment

merged_df = setup_environment()
#---------------------------------------------------------------------------------------前處理
merged_df[' 速限-第1當事者'] = pd.to_numeric(merged_df[' 速限-第1當事者'], errors='coerce')
#---------------------------------------------------------------------------------------將 '速限' 欄位轉換為數值類型
merged_df['受傷人數'] = pd.to_numeric(merged_df['受傷人數'], errors='coerce')
#---------------------------------------------------------------------------------------將 '受傷人數' 欄位轉換為數值類型
merged_df.dropna(subset=[' 速限-第1當事者'], inplace=True)
#---------------------------------------------------------------------------------------移除 '速限-第1當事者' 欄位值為 NaN 的列
plt.figure(figsize=(10, 6))
#---------------------------------------------------------------------------------------建立圖表
merged_df = merged_df[(merged_df[' 速限-第1當事者']>= 30)&(merged_df[' 速限-第1當事者']<= 120)]
#---------------------------------------------------------------------------------------進行塞選>=30 <=120
model = LinearRegression()
X = merged_df[[' 速限-第1當事者']]
y = merged_df['受傷人數']
#---------------------------------------------------------------------------------------創建線性回歸模型，將 '速限' 欄位作為特徵，'受傷人數' 欄位作為目標
model.fit(X, y)
#---------------------------------------------------------------------------------------訓練線性回歸模型
predictions = model.predict(X)
plt.scatter(merged_df[' 速限-第1當事者'], merged_df['受傷人數'], alpha=0.5,label ='觀測值')
plt.plot(merged_df[' 速限-第1當事者'], predictions, color='red',linewidth =3,label= '預測值')
#---------------------------------------------------------------------------------------預測受傷人數
plt.xticks(fontsize=10,rotation=45 ,ha ='right')
plt.yticks(fontsize=10)
plt.xlabel('速限')
plt.ylabel('受傷人數')
plt.title('限速與受傷人數關聯散佈圖')
#---------------------------------------------------------------------------------------補上軸標籤
plt.legend()
plt.savefig('限速與受傷人數關聯散佈圖.png')
plt.show()

